export const features = [
    {
        title: 'Широкий ассортимент',
        text: 'Более 50 наименований цветов и растений. Разнообразие букетов, композиций и подарочных наборов на любой вкус.'
    },
    {
        title: 'Высокий уровень сервиса',
        text: 'Оперативная обработка и доставка заказов, а так же вежливый и клиентоориентированный персонал.'
    },
    {
        title: 'Оперативная доставка',
        text: 'Доставляем букеты свежими и вовремя — даже срочные заказы не проблема!'
    },
    {
        title: "Удобство заказа",
        text: 'Несколько вариантов доставки (курьером, самовывоз).'
    },
    {
        title: 'Индивидуальный подход',
        text: 'Наши профессиональные флористы с любовью и вниманием относятся к созданию каждого букета или композиции. Каждое творение неповторимо и уникально, ведь мы вкладываем частичку своей души в каждую работу.'
    }
];