import './Footer.css';
import logotype from '../../assets/images/logotype.jpg';
import {Link} from "react-router-dom";

const Footer = () => {
    return (
        <footer className="footer">
            <div className="footer__content">
                <div className="footer__info">
                    <img src={logotype} alt="Логотип" className="footer__logo"/>
                    <div className="footer__socials">
                        <h4 className="footer__title">Подберем для вас идеальный букет</h4>
                        <p className="footer__comment">Пишите нам в социальные сети</p>
                        <div className="footer__socials-list">
                            <a href="https://www.instagram.com/lavanda_prt/" target="_blank" rel="noopener noreferrer"
                               className="footer__social footer__social--instagram">
                                <svg viewBox="0 0 134 134" fill="#c8c8c8" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M66.5369 0C48.4665 0 46.2006 0.0766603 39.1037 0.400337C32.0216 0.723419 27.1849 1.84836 22.9525 3.4929C18.5771 5.19329 14.8665 7.46853 11.1676 11.1674C7.46853 14.8663 5.19329 18.5773 3.49309 22.9527C1.84817 27.1849 0.723617 32.0216 0.400139 39.1037C0.0764622 46.2006 0 48.4665 0 66.5369C0 84.607 0.0764622 86.8729 0.400139 93.9698C0.723617 101.052 1.84817 105.889 3.49309 110.121C5.19349 114.496 7.46873 118.207 11.1676 121.906C14.8667 125.605 18.5771 127.88 22.9525 129.581C27.1849 131.225 32.0216 132.35 39.1037 132.673C46.2006 132.997 48.4665 133.074 66.5369 133.074C84.607 133.074 86.8729 132.997 93.9698 132.673C101.052 132.35 105.889 131.225 110.121 129.581C114.496 127.88 118.207 125.605 121.906 121.906C125.605 118.207 127.88 114.496 129.581 110.121C131.225 105.889 132.35 101.052 132.673 93.9698C132.997 86.8729 133.074 84.607 133.074 66.5369C133.074 48.4665 132.997 46.2006 132.673 39.1037C132.35 32.0216 131.225 27.1849 129.581 22.9527C127.88 18.5773 125.605 14.8663 121.906 11.1674C118.207 7.46853 114.496 5.19329 110.121 3.4929C105.889 1.84836 101.052 0.723419 93.9698 0.400337C86.8729 0.0766603 84.607 0 66.5369 0ZM66.5369 11.9885C84.3027 11.9885 86.4072 12.0565 93.4233 12.3766C99.9107 12.6723 103.434 13.7563 105.778 14.6675C108.884 15.8746 111.101 17.3163 113.429 19.6446C115.757 21.973 117.199 24.1896 118.406 27.2952C119.317 29.6398 120.401 33.163 120.697 39.6502C121.017 46.6663 121.085 48.7708 121.085 66.5368C121.085 84.3027 121.017 86.4072 120.697 93.4233C120.401 99.9107 119.317 103.434 118.406 105.778C117.199 108.884 115.757 111.101 113.429 113.429C111.101 115.757 108.884 117.199 105.778 118.406C103.434 119.317 99.9105 120.401 93.4233 120.697C86.4084 121.017 84.3041 121.085 66.5368 121.085C48.7694 121.085 46.6655 121.017 39.6502 120.697C33.1628 120.401 29.6398 119.317 27.2954 118.406C24.1894 117.199 21.973 115.757 19.6448 113.429C17.3165 111.101 15.8746 108.884 14.6675 105.778C13.7563 103.434 12.6725 99.9105 12.3766 93.4233C12.0565 86.4072 11.9885 84.3027 11.9885 66.5368C11.9885 48.7708 12.0565 46.6663 12.3766 39.6502C12.6725 33.1628 13.7563 29.6398 14.6675 27.2954C15.8746 24.1894 17.3165 21.973 19.6446 19.6448C21.973 17.3163 24.1896 15.8746 27.2952 14.6675C29.6398 13.7563 33.163 12.6723 39.6502 12.3766C46.6663 12.0565 48.7708 11.9885 66.5368 11.9885" fill="#ffffff"/>
                                    <path d="M66.537 88.7157C54.2876 88.7157 44.3578 78.7859 44.3578 66.5369C44.3578 54.2875 54.2876 44.3577 66.537 44.3577C78.786 44.3577 88.7157 54.2875 88.7157 66.5369C88.7157 78.7859 78.786 88.7157 66.537 88.7157ZM66.537 32.3692C47.6664 32.3692 32.3693 47.6664 32.3693 66.5369C32.3693 85.407 47.6664 100.704 66.537 100.704C85.4071 100.704 100.704 85.407 100.704 66.5369C100.704 47.6664 85.4071 32.3692 66.537 32.3692ZM110.039 31.0193C110.039 35.4291 106.464 39.0036 102.054 39.0036C97.6448 39.0036 94.0699 35.4291 94.0699 31.0193C94.0699 26.6096 97.6448 23.0347 102.054 23.0347C106.464 23.0347 110.039 26.6096 110.039 31.0193Z" fill="#ffffff"/>
                                </svg>
                            </a>
                            <a href="https://t.me/lavandapartizansk" target="_blank" rel="noopener noreferrer"
                               className="footer__social">
                                <svg xmlns="http://www.w3.org/2000/svg" fill="currentColor"
                                     className="bi bi-telegram" viewBox="0 0 16 16">
                                    <path
                                        d="M16 8A8 8 0 1 1 0 8a8 8 0 0 1 16 0M8.287 5.906q-1.168.486-4.666 2.01-.567.225-.595.442c-.03.243.275.339.69.47l.175.055c.408.133.958.288 1.243.294q.39.01.868-.32 3.269-2.206 3.374-2.23c.05-.012.12-.026.166.016s.042.12.037.141c-.03.129-1.227 1.241-1.846 1.817-.193.18-.33.307-.358.336a8 8 0 0 1-.188.186c-.38.366-.664.64.015 1.088.327.216.589.393.85.571.284.194.568.387.936.629q.14.092.27.187c.331.236.63.448.997.414.214-.02.435-.22.547-.82.265-1.417.786-4.486.906-5.751a1.4 1.4 0 0 0-.013-.315.34.34 0 0 0-.114-.217.53.53 0 0 0-.31-.093c-.3.005-.763.166-2.984 1.09"/>
                                </svg>
                            </a>
                            <a href="https://wa.me/79146627911?text=Здравствуйте" target="_blank"
                               rel="noopener noreferrer" className="footer__social footer__social--instagram">
                                <svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px" fill="#ffffff" width="100" height="100" viewBox="0 0 32 32">
                                    <path fill-rule="#000000" d="M 24.503906 7.503906 C 22.246094 5.246094 19.246094 4 16.050781 4 C 9.464844 4 4.101563 9.359375 4.101563 15.945313 C 4.097656 18.050781 4.648438 20.105469 5.695313 21.917969 L 4 28.109375 L 10.335938 26.445313 C 12.078125 27.398438 14.046875 27.898438 16.046875 27.902344 L 16.050781 27.902344 C 22.636719 27.902344 27.996094 22.542969 28 15.953125 C 28 12.761719 26.757813 9.761719 24.503906 7.503906 Z M 16.050781 25.882813 L 16.046875 25.882813 C 14.265625 25.882813 12.515625 25.402344 10.992188 24.5 L 10.628906 24.285156 L 6.867188 25.269531 L 7.871094 21.605469 L 7.636719 21.230469 C 6.640625 19.648438 6.117188 17.820313 6.117188 15.945313 C 6.117188 10.472656 10.574219 6.019531 16.054688 6.019531 C 18.707031 6.019531 21.199219 7.054688 23.074219 8.929688 C 24.949219 10.808594 25.980469 13.300781 25.980469 15.953125 C 25.980469 21.429688 21.523438 25.882813 16.050781 25.882813 Z M 21.496094 18.445313 C 21.199219 18.296875 19.730469 17.574219 19.457031 17.476563 C 19.183594 17.375 18.984375 17.328125 18.785156 17.625 C 18.585938 17.925781 18.015625 18.597656 17.839844 18.796875 C 17.667969 18.992188 17.492188 19.019531 17.195313 18.871094 C 16.894531 18.722656 15.933594 18.40625 14.792969 17.386719 C 13.90625 16.597656 13.304688 15.617188 13.132813 15.320313 C 12.957031 15.019531 13.113281 14.859375 13.261719 14.710938 C 13.398438 14.578125 13.5625 14.363281 13.710938 14.1875 C 13.859375 14.015625 13.910156 13.890625 14.011719 13.691406 C 14.109375 13.492188 14.058594 13.316406 13.984375 13.167969 C 13.910156 13.019531 13.3125 11.546875 13.0625 10.949219 C 12.820313 10.367188 12.574219 10.449219 12.390625 10.4375 C 12.21875 10.429688 12.019531 10.429688 11.820313 10.429688 C 11.621094 10.429688 11.296875 10.503906 11.023438 10.804688 C 10.75 11.101563 9.980469 11.824219 9.980469 13.292969 C 9.980469 14.761719 11.050781 16.183594 11.199219 16.382813 C 11.347656 16.578125 13.304688 19.59375 16.300781 20.886719 C 17.011719 21.195313 17.566406 21.378906 18 21.515625 C 18.714844 21.742188 19.367188 21.710938 19.882813 21.636719 C 20.457031 21.550781 21.648438 20.914063 21.898438 20.214844 C 22.144531 19.519531 22.144531 18.921875 22.070313 18.796875 C 21.996094 18.671875 21.796875 18.597656 21.496094 18.445313 Z"></path>
                                </svg>
                            </a>
                        </div>
                        <small>* принадлежит компании Meta, которая признана
                            экстремистской и запрещена на территории РФ</small>
                    </div>
                </div>

                <div className="footer-menu">
                    <h4 className="footer-menu__title">Каталог</h4>
                    <ul className="footer-menu__list">
                        <li className="footer-menu__item">
                            <Link to="/catalog?category=монобукет" className="footer-menu__link">Монобукет</Link>
                        </li>
                        <li className="footer-menu__item">
                            <Link to="/catalog?category=дуобукет" className="footer-menu__link">Дуобукет</Link>
                        </li>
                        <li className="footer-menu__item">
                            <Link to="/catalog?category=цветочные+композиции" className="footer-menu__link">Цветочные композиции</Link>
                        </li>
                        <li className="footer-menu__item">
                            <Link to="/catalog?category=свадебные+букеты" className="footer-menu__link">Свадебные букеты</Link>
                        </li>
                        <li className="footer-menu__item">
                            <Link to="/catalog?category=комнатные+растения" className="footer-menu__link">Комнатные растения</Link>
                        </li>
                        <li className="footer-menu__item">
                            <Link to="/catalog?category=открытки" className="footer-menu__link">Открытки</Link>
                        </li>
                        {/*<li className="footer-menu__item">*/}
                        {/*    <Link to="/catalog?category=подарочный+сертификат" className="footer-menu__link">Подарочный сертификат</Link>*/}
                        {/*</li>*/}

                    </ul>
                </div>

                <div className="footer-menu">
                    <h4 className="footer-menu__title">Клиентам</h4>
                    <ul className="footer-menu__list">
                        <li className="footer-menu__item">
                            <a href="/delivery" className="footer-menu__link">Доставка</a>
                        </li>
                        <li className="footer-menu__item">
                            <a href="/payment" className="footer-menu__link">Оплата</a>
                        </li>
                        <li className="footer-menu__item">
                            <a href="/faq" className="footer-menu__link">Вопрос-ответ</a>
                        </li>
                        <li className="footer-menu__item">
                            <a href="" className="footer-menu__link">Уход за букетом</a>
                        </li>
                    </ul>
                </div>

                <div className="footer__contacts">
                    <div className="footer__contact">
                        <h4 className="footer__title">Контакты</h4>
                        <p className="footer__address">Партизанск, ул. Замараева, 5</p>
                        <p className="footer__work-schedule">График работы: 8:00 - 19:00</p>
                    </div>

                    <div className="footer__feedback">
                        <h4 className="footer__title">Обратная связь</h4>
                        <p className="footer__phone">+7 (914) 662-79-11</p>
                    </div>

                    <div className="footer__email">
                        <h4 className="footer__title">Почта</h4>
                        <p className="footer__email">lavanda.ptz@mail.ru</p>
                    </div>
                </div>
            </div>

            <div className="footer__bottom">
                <p className="footer__bottom-text">&copy; {new Date().getFullYear()} Lavanda. Все права защищены.</p>
                <a href="" className="footer-menu__link">Политика</a>
                <a href="" className="footer-menu__link">Договор оферты</a>
                <a href="" className="footer-menu__link">Сайт разработан @gonosanna</a>
            </div>
        </footer>
    );
};

export default Footer;
