export const faqItems = [
    {
        question: "Как оформить заказ?",
        answer: "Заказ можно оформить через наш сайт, добавив выбранные товары в корзину и следуя инструкциям на экране."
    },
    {
        question: "Есть ли у вас доставка?",
        answer: "Да, мы предлагаем доставку по городу. Вы можете выбрать удобное время и адрес доставки при оформлении заказа."
    },
    {
        question: "Как проверить статус моего заказа?",
        answer: "Вы можете проверить статус своего заказа в личном кабинете на нашем сайте или связавшись с нашей службой поддержки."
    },
    {
        question: "Можно ли изменить адрес доставки после оформления заказа?",
        answer: "Да, если ваш заказ еще не был отправлен, вы можете изменить адрес, связавшись с нашей службой поддержки."
    },
    {
        question: "Как оплатить заказ?",
        answer: "Вы можете оплатить заказ несколькими способами: картой при заказе цветов по определенному адресу " +
            "или наличными/картой при самовывозе."
    },
    {question: "Какая минимальная сумма заказа?", answer: "Минимальная сумма заказа составляет 1500 рублей."},
    {
        question: "Предоставляете ли вы сопроводительные карточки или открытки?",
        answer: "Да, мы можем добавить открытку с вашим поздравлением к вашему заказу. Просто укажите текст при оформлении."
    },
    {
        question: "Изготавливаете ли вы букеты на заказ?",
        answer: "Конечно! Мы изготавливаем индивидуальные букеты по вашим пожеланиям или если вы не нашли подходящего" +
            " из каталога на сайте. Просто напишите нам, и мы с радостью поможем."
    },
    {
        question: "Работаете ли вы в выходные и праздничные дни?",
        answer: "Да, наш магазин работает по выходным и праздничным дням. Время работы указано на нашем сайте."
    },
    {
        question: "Есть ли у вас программа лояльности?",
        answer: "Да, у нас есть программа лояльности для постоянных клиентов. С каждой покупкой вы накапливаете" +
            " бонусные баллы, которые можно использовать для последующих заказов."
    },
    {
        question: "Как ухаживать за цветами?",
        answer: "Рекомендуем обрезать стебли под углом, менять воду каждые 2-3 дня и держать цветы в прохладном месте " +
            "вдали от прямых солнечных лучей. Так же на нашем сайте в разделе 'Уход за букетом'." +
            " Там мы заботливо разместили подробные инструкции по уходу за букетами и композициями."
    },
];
